{
    "1098022264166076421": {
        "sentiment": 1,
        "text": "THIS is why captain marvel was made, not to make a statement, not to be overly feministic, and not to flex on men. this movie is for the GIRLS. to empower and make them feel good about themselves (like wonder woman did for dc) and all of y’all should be supporting it. PERIOD. https://t.co/3jzqiZQ9Cg"
    },
    "1098022331140767744": {
        "sentiment": -1,
        "text": "RT @MartinaMarkota: Captain Marvel is just a feminist mess\n\nhttps://t.co/0bpwPVYmco"
    },
    "1098022337226657793": {
        "sentiment": -1,
        "text": "RT @DDayCobra: Another day, another stupid Captain Marvel article. \n\nhttps://t.co/aXtnJkXJjS"
    },
    "1098022374824267776": {
        "sentiment": 1,
        "text": "RT @damnversdrew: WE ARE TWO WEEKS AWAY FROM CAPTAIN MARVEL??????? YA'LL HEAR ME??????????????? TWO WEEKS TO GO!!!!!!!!!!!!!! https://t.co/…"
    },
    "1098022381157638145": {
        "sentiment": 0,
        "text": "I think my favorite complaint about the Captain Marvel movie is the old guy on the radio today who was mad because he’s a huge Billy Batson fan and that character doesn’t seem to be in the film."
    },
    "1098022402368458753": {
        "sentiment": 1,
        "text": "RT @WolfLaufer99: I wanted to draw this beautiful this couple: ( ♥️ Captain Marvel X Spiderwoman) #caroljess https://t.co/T9q5R396oB"
    },
    "1098022426728910851": {
        "sentiment": -1,
        "text": "The difference between Gal Gadot and Brie Larson is that Gal Gadot is an elegant, class act woman, meanwhile Brie Larson is a whiny, attention seeking cry baby. So please; stop trying to make Brie Larson and Captain Marvel happen, it won't happen."
    },
    "1098022444999204864": {
        "sentiment": 0,
        "text": "@YourNerdWonder The real captain marvel"
    },
    "1098022448874827776": {
        "sentiment": 0,
        "text": "RT @Ironjotun: Lesbians and bisexuals when the white straight men don’t show up to Captain Marvel  https://t.co/cNLagm4Ywt"
    },
    "1098022519225741312": {
        "sentiment": 0,
        "text": "@Marvel definitely does not want to people to watch this video, it exposes their hypocrisy, hence why ticket sales and Hollywood is irrelevant in general @MarvelStudios @captainmarvel @CaptMarvelNews @MarvelUK #USA #Canada #America @MartinaMarkota"
    },
    "1098022573777014785": {
        "sentiment": -1,
        "text": "@Cr0ss0ver_U @comicsforjack @letstalkparker @Benjamin_Percy True, I was using Ric as an example of a poor change to an already established character. And I would argue Ms MARVEL became a much weaker hero (character wise) when they slapped the captain onto her title. As opposed to leaving her as she was without having someone else's name"
    },
    "1098022591124520962": {
        "sentiment": 1,
        "text": "Awwwww damn just got the Captain Marvel press screening invite.....here we go."
    },
    "1098022622175158272": {
        "sentiment": 0,
        "text": "When Captain Marvel makes a ton of money at the box office, I'm sure this same \"news\" site will have a full breakdown of how Disney fudged the numbers, sent shills to say nice things about it while also giving everyone money to go see the movie.\n\nSCOOP: YOU HEARD IT HERE 1ST!"
    },
    "1098022659323875328": {
        "sentiment": 0,
        "text": "RT @RobertStorms84: So I guess I should do more Captain Marvel videos🤔 https://t.co/2sg9ggf4oY"
    },
    "1098022686314426370": {
        "sentiment": 0,
        "text": "If @brielarson can get though all the criticisms of being Captain Marvel, I can get through my professors being awful people towards me and my STEM ladies ♥️⭐️💙"
    },
    "1098022713220833280": {
        "sentiment": 1,
        "text": "Sad men try to sink Rotten Tomatoes audience score for Captain Marvel https://t.co/6wBB9uMF8E"
    },
    "1098022749589520384": {
        "sentiment": -1,
        "text": "@ActorJoshPrice You're making my point. As evidenced by the Tomatometer &amp; CinemaScore, most who saw TLJ before the \"divisive\" narrative formed liked it. The audience score is the least reliable metric here. (To wit: the troll bombardment against Captain Marvel, a movie people haven't yet seen.)"
    },
    "1098022818476896256": {
        "sentiment": 0,
        "text": "I'm Kelly Thompson and I write comics like Captain Marvel, West Coast   Avengers, Mr. &amp; Mrs. X, Jessica Jones, Sabrina, Nancy Drew, Hawkeye,  Uncanny X-Men, &amp; Phasma. I'm currently rebuilding my website but the shop is open: https://t.co/NPuTnl7MJb #VisibleWomen https://t.co/baYW9JyHh2"
    },
    "1098022828509675520": {
        "sentiment": 1,
        "text": "@DDayCobra, I have posted this to @GeeksGamersCom, but I send it also to you. It might help you think more positively about Captain Marvel. https://t.co/j4jTpzYDrl"
    },
    "1098022850915696640": {
        "sentiment": 1,
        "text": "RT @damnversdrew: WE ARE TWO WEEKS AWAY FROM CAPTAIN MARVEL??????? YA'LL HEAR ME??????????????? TWO WEEKS TO GO!!!!!!!!!!!!!! https://t.co/…"
    },
    "1098022852916326405": {
        "sentiment": -1,
        "text": "😂🤩 When Captain Marvel is going to fail and its blamed on fans hating strong female characters. #Gag #Smile #Fresh #Hot #Humor #Fresh\nhttps://t.co/l9JSCPkbGG"
    },
    "1098022863607451648": {
        "sentiment": 0,
        "text": "WOAH WOAH WOAH - are you saying that some men don't like it when roles are gender-flipped (Ghostbusters) AND they don't like it when canon female superheroes get represented in their own movies?!\nIt's as though they just don't like *women* in general?!\nhttps://t.co/e0o5RMTTNK"
    },
    "1098022871404896256": {
        "sentiment": -1,
        "text": "Hollywood: Make better movies if you want people to show up.\n\nOh, and I might be careful about making Captain Marvel the embodiment of your hopes, too.\n\nhttps://t.co/QFn1q58oJi"
    }
}